{"indexTitle":"Ripple API","NavHome":"Home","NavAPI":"Ripple API","NavPrice":"Price","NavDocs":"Documents","NavHelp":"Help","NavAPP":"Wallet APP","NavPersonal":"Personal Center","NavLogin":"Login","NavRegister":"Register","ModalEmail":"Please enter your email account","ModalForgotPassword":"Forgot your password","ModalAuthenticationCode":"Please enter a verification code","ModalPassword":"Please enter your login password","ModalPasswordOneMore":"Confirm your Login password again","ModalhaveAccount":"Already have an account","ModalGoLogin":"Go Login","ModalGetAccount":"Get the Verification code","IndexBannerSatisfy":"Meet a wide range of cross-border payment needs","IndexBannerProgramme":"Industry-leading global payment blockchain solutions","IndexBannerUseNow":"Use now","IndexProblemsWoldPay":"Global Payment challenges","IndexProblemsOperation":"Difficult to operate","IndexProblemsOperationP":"Even though technology has developed so far, it has been difficult to send remittances due to different locations","IndexProblemsSlowProcess":"Slow process","IndexProblemsSlowProcessP":"Slow remittance, slow settlement, difficult operation, too much time cost","IndexProblemsSafe":"Security","IndexProblemsSafeP":"Unable to grasp real-time trends, payment security can not be guaranteed","IndexProblemsChoose":"Reasons to choose Ripple","IndexAdvantageWorldPay":"Global payment","IndexAdvantageWorldPayP":"Ripple is the world's only enterprise blockchain solution for global payments, with banks using XCURRENT to handle global payments to customers","IndexAdvantageSafe":"Security and stability","IndexAdvantageSafeP":"Technology mature, safe and stable, a variety of technical solutions to ensure the user's use of security, enterprises using XVIA, access to RIPPLENET, payment.","IndexAdvantageEfficiency":"Efficient and convenient","IndexAdvantageEfficiencyP":"Efficient and convenient blockchain technology services, experience unprecedented fast trading, payment service providers use XRAPID to seek on-demand liquidity.","IndexChooseDevChoose":"The developer chose Ripple API","IndexChooseCustomer":"Customer Service Support","IndexChooseCustomerTime":"Service hours: Monday to Friday 9:00-18:00","APIBannerPaymentServices":"Provide open Payment services","APIMainBank":"Bank","APIMainIncome":"New Revenue generation","APIMainIncomeWay":"Way","APIMainManyCountries":"Ripple has now achieved global payments at 27 national banks, processed cross-border payments in real time, tracked capital flows, instant remittance and liquidation, and addressed new market expansion issues with high costs and difficulties, providing new ways for banks to generate revenue.","APIMainSuppliers":"Payment service providers","APIMainPayScope":"Scope of payment","APIMainCovered":"Full Coverage","APIMainPp1":"Ripple provides global payment solutions while also providing more customers and larger trading volumes, connecting Ripple with financial institutions to make payments more secure, transparent, and end-to-end traceability to make payments more standardized and processes more open.","APIMainEnterprise":"Enterprise","APIMainSimplified":"Simplified payment","APIMainSimplifiedProcess":"Process","APIMainPp2":"Ripple's excellent data consolidation capabilities simplify enterprise payment procedures, especially as cross-border companies improve productivity, save time and labor costs in the face of cumbersome global payments, and can capture the flow of money and provide efficient payment services to businesses.","APIMainSafeFunds":"Safe and reliable financial flows","APIMainSafeFundsMethods":"Way","APIMainPp3":"XRP is a safe and reliable way for Ripple to flow money to solve the global payment challenges of the enterprise. Since XRP is safer and more reliable as a global payment digital currency, it allows the trading platform to handle more payments and obtain a more stable number of payments.","APIMainJoinParticipants":"Participants in Ripple","APIMainJoinPromoter":"Ripple's promoter","APIMainPp4":"Promoters include banks that want to process payments for businesses and consumers and provide liquidity to each other, and banks take advantage of UBS to improve the quality of service to existing users and gain access to new customers at the same time. The advent of the digital currency XRP further reduces the cost to banks and provides 0 global payment experiences that hinder blockchain technology solutions, with instant security, efficiency and convenience. Ripple's banking footprint spans the world, including in San Francisco, New York, London, Sydney, Mumbai and Luxembourg.","APIMainJoinInitiator":"Payment Initiator","APIMainPp5":"Enterprises that make large payments in global supply chains for greater capital efficiency, platform enterprises with large amounts of small payments to suppliers around the world, customers who overcome inefficient and high-cost banks and payment providers, and global payments that require low costs and can be tracked in real time.","APIMainAdvantageSpeed":"Payment speed","APIMainAdvantageSpeedP":"Payment settlement is completed within 4 seconds and global payments are not subject to cross-border distress.","APIMainAdvantageScalability":"Scalability","APIMainAdvantageScalabilityP":"Powerful scalability and transaction processing capabilities, processing 1500 trades per second in a row.","APIMainAdvantageSafe":"Security and stability","APIMainAdvantageSafeP":"XRP has a stable technical support and perfect system, smooth the ultimate experience.","APPMainRightTitle":"Efficient&nbsp;&nbsp;Convenient&nbsp;&nbsp;Safe&nbsp;&nbsp;Stability","APPMainRightP":"Ripple Wallet App is an international leading Ripple coin management platform app, has been 'efficient and convenient, safe and stable' platform services, leading the industry for many years, serving users in various countries. Ripple Wallet App provides Android, Apple version of the two versions of the app download to meet the needs of different users, another unique financial security model, the use of a sound internal system, a full range of protection of user assets security, to ensure user data security and the efficient operation of the app.","APPMainRightErIOS":"download<br />(IOS)","APPMainRightErAndroid":"download<br />(Android)","DocsMainP1":"Developer's Guide","DocsMainP2":"SDK documentation","DocsMainP3":"FAQ","DocsChoosePhoneNumber1":"136-9795-6547","DocsChooseWechatNumber":"fhenif4784","DocsChoosePhoneNumber2":"498462194","HelpMainSearchBox":"Please search here for the problem you are experiencing","HelpMainSearchBtn":"Search","HelpMainH41":"How do I register?","HelpMainP1":"1.Login to Ripple home, Chinese users choose the default language is Chinese;<br />2.Click 'Register' on the right side of the home page to enter the registration screen;<br />3.Please enter 'mobile phone number/email account' To obtain the verification code;<br />4.View your phone or login email to view the verification code, fill in the Verification code and login password;<br />5.Select Identity 'Personal User/Enterprise User';<br />6.Upload a copy of the business license;<br />7.Fill in the Contact number and click 'Submit Registration'.","HelpMainH42":"How do I sign in?","HelpMainP2":"1.Login to Ripple home, Chinese users choose the default language is Chinese;<br />2.Click 'Login' on the right side of the home page to enter the login screen;<br />3.Enter the mobile phone number or email account you used to register;<br />4.Enter the correct login password;<br />5.Click 'Sign In'.<br />","HelpMainH43":"How to retrieve a password?","HelpMainP3":"1.Login to Ripple home, Chinese users choose the default language is Chinese;<br />2.Click 'Login' on the right side of the home page to enter the login screen;<br />3.Click 'Forgot Password' in the lower-right corner of the 'login' page;<br />4.Go to the 'Forgot Password' interface, enter the mobile phone number or email account you used to register, get the verification code;<br />5.View your phone or login email to view the verification code and fill in the Verification code;<br />6.Enter a new password and click 'Confirm'.<br />","HelpMainH44":"How to modify a password?","HelpMainP4":"1. Login to Ripple home, Chinese users choose the default language is Chinese, login existing account number；<br />2.Click to enter 'Personal Center' and select 'Password Settings'；<br />3.Select 'Modify Login Password'；<br />4.Please enter the correct information according to the prompts；<br />5.Save the settings and the login password modification was successful.","HelpMainH45":"How do I buy XRP?","HelpMainP5":" 1.Enter the Ripple home page, Chinese users choose the default language is Chinese； <br />2.Login account, return to the home page;<br />3.Click on the home page 'Buy Now';<br />4.Please follow the prompts, choose any contact information, contact Customer service consulting to buy.","HelpMainH46":"How to contact customer service?","HelpMainP6":"1.Customer Service Contact Number：136-9795-6547；<br />2.Customer Service Contact WeChat：FHENIF4784；<br />3.Customer Service Contact WeChat QQ：498462194；<br />4.Service hours: Monday to Friday 9:00-19:00;5.Customer service will respond to you within 24 hours, except on statutory holidays.","HelpMainH47":"What are the standard operating procedures for Ripple on money laundering and suspicious economic activity?","HelpMainP7":"Ripple is committed to monitoring and reporting any anti-money laundering marks in the XRP Ledger network and, where applicable, to reporting suspicious activity to regulators.","HelpMainH48":"Does Ripple distinguish between code libraries for validation and code libraries for user software?","HelpMainP8":"Yes, the client software for the XRP ledger (including RIPPLE-LIB) has a different code base and a repository from RIPPLED (validation).","HelpMainH49":"What happens if more than 20% of the nodes in the network disagree with the majority?<br />How do I select the final version of the ledger?","HelpMainP9":"The network may temporarily stop reconfiguring to continue to be based on a new UNL list that wants to reach consensus. This temporary processing delay is expected, not a double cost.<br />There may be multiple temporary internal versions in the process of determining the final authoritative version of the ledger. This internal version will occur in a distributed system because not all nodes receive transactions in the same order. The similar behavior of bitcoin is that two servers each see a different longest chain because two blocks are mined around the same time. However, at any time there is only one authoritative version of the ledger. Other versions are irrelevant and harmless.","HelpMainH410":"What is the incentive for the validation node running ripple?","HelpMainP10":"If the XRP books are successful and widely used in inter-bank settlements, participants will be motivated to ensure the reliability and stability of the network. If so, the organization will run the RIPPLED server to participate in the network. Once you run a server, the additional cost and effort to run a validation node is basically 0-it simply sets the software switch under. The validation node determines that the XRP ledger changes, so the primary motivation for running the validation node is to maintain and protect the stable operation of the network and correct changes.","HelpMainContactCustomer":"If you have any questions, please contact customer service","PriceBannerPricing":"Pricing","PriceBannerPricingMethod":"Pricing Method :","PriceBannerHandlingFee":"A 5% handling fee is charged based on the amount of the transaction for each transfer","PriceBannerCostBudget":"Cost Budget :","PriceBannerNumberOfTransfers":"Enter the number of XRP transfers","PriceBannerEstimatedFee":"Estimated fee","PriceBannerEstimatedTransferVolume":"Current Estimated transfer Volume : ","PriceBannerEstimatedHandlingFee":"; Estimated Handling Fee : ","PersonMainMenuPersonalCenter":"PersonalCenter","PersonMainMenuPersonalInformation":"PersonalInformation","PersonMainMenuTransferRecords":"TransferRecords","PersonMainMenuExitLogin":"ExitLogin","PersonMainControlEmail":"Mailbox number","PersonMainControlPassword":"Password","PersonMainControlChange":"modify","PersonMainControlReceiptAddress":"heceiptAddress","PersonMainControlHitAddress":"hitAddress","PersonMainControlShow":"show","PersonMainControlGetKey":"Apply for key","PersonMainScreening":"Screening","PersonMainReceipt":"Income","PersonMainHit":"Out","PersonMainStartTime":"Start time","PersonMainEndTime":"End time","PersonMainExportByTime":"ExByTime","PersonMainExportAll":"ExAll","PersonMainType":"Type","PersonMainTime":"Time","PersonMainAmount":"Amount（XRP）","PersonMainHandlingFee":"Handling fee","PersonMainFlowNumber":"Flow number","PersonMainLastPage":"Last page","PersonMainPage":"page","PersonMainJumpTo":"jump to","PersonChangePassword":"Modify password","PersonChangePasSend":"has been sent(","PersonChangePasSecond":")seconds","PersonChangeSendCode":"Send a verification code","PersonChangeCode":"Authentication Code","PersonChangeNewPas":"Enter a new password","PersonChangeConfirmNewPas":"Confirm the new password","PersonChangeConfirm":"Confirm","PersonKeyShowOneTips":"Tips","PersonKeyShowOnce":"Key is displayed only once, please save it properly!","PersonKeyShowOneCancel":"Cancel","PersonChangeHitAddress":"Modify the debit Address","PersonChangeNewHitAddress":"Enter a new call address:","PersonChangeReceiptAddress":"Modify a collection Address","PersonChangeNewReceiptAddress":"Enter a new collection address:"}